app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    raise params.inspect
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-11 17:57:21.024827"], ["id", 1]]